taskt/Core/ApplicationSettings/SafeAutomationEngineInstanceEngineSettings.dot
digraph "SafeAutomationEngineInstanceEngineSettings" {
"SafeAutomationEngineInstanceEngineSettings" -> "SafeEngineSettings";
"SafeEngineSettings" -> "IEngineSettings";
}
