taskt/Core/ApplicationSettings/SafeAutomationEngineInstanceEngineSettings.puml
@startuml
SafeAutomationEngineInstanceEngineSettings --> SafeEngineSettings
SafeEngineSettings --> IEngineSettings
@enduml
